wadd_3_homework_2/taste_buds_api/app/controllers/application_controller.rb

    def current_user
        current_user ||= User.find_by_id session[:user_id] if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]