wadd_3_homework_2/taste_buds_api/app/controllers/api/v1/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        recipes = Recipe.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        recipe = Recipe.find params[:id]

INSERT INTO "recipes" ("title", "story", "description", "people_number", "spicy", "salty", "sweet", "user_id", "created_at", "updated_at", "image_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        @recipe = Recipe.new recipe_params
        @recipe.user = current_user;
        if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 2]]
---
    def destroy
        @recipe = Recipe.find params[:id]
        if @recipe.destroy