wadd_3_homework_2/taste_buds_api/app/controllers/api/v1/reviews_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "body", "user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 5], ["body", "delicious food"], ["user_id", 4], ["recipe_id", 1], ["created_at", "2023-07-17 02:37:43.929471"], ["updated_at", "2023-07-17 02:37:43.929471"]]
---
    def create

        review = Review.new review_params
        recipe = Recipe.find params[:recipe_id]
        review.user = current_user
        review.recipe = recipe

        if review.save