wadd_3_homework_2/taste_buds_api/app/controllers/api/v1/sessions_controller.rb

    def create

        @user = User.find_by_email(sign_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hooman@minoo.com"], ["LIMIT", 1]]